In [1]:
import pandas as pd
import matplotlib.pyplot as plt
%matplotlib inline
import seaborn as sns
import sqlalchemy

In [2]:
durham = pd.read_excel('city-of-durham-police-crime-reports_4.xlsx')

In [3]:
raleigh = pd.read_csv('RaleighPoliceIncidents.csv')

In [4]:
cary = pd.read_csv('Cary.txt', sep=';')

## Overview of the tables

In [5]:
cary.head(2)

,crime_category,crime_type,chrgcnt,ucr,district,beat_number,map_reference,incident_number,time_from,time_to,...,phxstatus,record,offensecategory,violentproperty,timeframe,domestic,location,period,radio,street
0,ALL OTHER,ALL OTHER - BLACKMAIL/ EXTORTION,NaN,2630,D1,114,P026,17000426,0001-01-01 03:40:00+00:00,0001-01-01 04:47:00+00:00,...,NaN,3011,All Other Offenses,All Other,"""Last Year""",N,35.788671414; -78.79625675,"""Everything;Last Year""","Everything,Last Year",KING ST
1,ALL OTHER,ALL OTHER - BLACKMAIL/ EXTORTION,NaN,2630,D3,118,P004,16009674,0001-01-01 11:53:00+00:00,0001-01-01 15:15:00+00:00,...,Active,3019,All Other Offenses,All Other,"""Last Year""",N,35.741041415; -78.75461019,"""Everything;Last Year""","Everything,Last Year",RIBBON LN

In [6]:
cary['crime_category'].value_counts()

ALL OTHER              2451
LARCENY                1379
BURGLARY                235
AGGRAVATED ASSAULT      164
MOTOR VEHICLE THEFT      64
ROBBERY                  57
ARSON                    13
MURDER                    1
Name: crime_category, dtype: int64

In [7]:
durham.head(2)

,geo_point_2d,inci_id,date_rept,hour_rept,yearstamp,monthstamp,date_occu,dow1,hour_occu,date_fnd,...,ucr_code,chrgdesc,csstatus,csstatusdt,addtime,reviewdate,ucr_type_o,dist,strdate,big_zone
0,-78.996264,13000190,2013-01-03 00:00:00+00:00,921,2013,1,2013-01-02 00:00:00+00:00,WE,2300,2013-01-03 00:00:00+00:00,...,650,LARCENY - AUTOMOBILE PARTS OR ACCESSORIES,1.0,2013-01-03 00:00:00+00:00,2013-01-03 00:00:00+00:00,2013-01-04 00:00:00+00:00,NaN,3.0,Jan 3 2013,Zone 3
1,-78.890730,13000148,2013-01-02 00:00:00+00:00,1845,2013,1,2013-01-02 00:00:00+00:00,WE,1830,2013-01-02 00:00:00+00:00,...,1400,VANDALISM TO AUTO (NOT ACCIDENTAL),1.0,2013-01-02 00:00:00+00:00,2013-01-02 00:00:00+00:00,2013-01-15 00:00:00+00:00,NaN,4.0,Jan 2 2013,Zone 4

In [8]:
durham['reportedas'].value_counts().head()

LARCENY            19312
BREAK IN           13158
BREAK IN VEHICL     8450
DOMESTIC VIOLEN     7913
FRAUD               6909
Name: reportedas, dtype: int64

In [9]:
raleigh.head(2)

,OBJECTID,GlobalID,case_number,crime_category,crime_code,crime_description,crime_type,reported_block_address,city_of_incident,city,...,reported_date,reported_year,reported_month,reported_day,reported_hour,reported_dayofwk,latitude,longitude,agency,updated_date
0,12001,9cdee08d-11c8-4789-864b-6965a1b2e620,NaN,MISCELLANEOUS,81H,Miscellaneous/Missing Person (18 & over),NaN,NaN,NaN,RALEIGH,...,2017-01-15T03:28:00.000Z,2017,1,14,22,Saturday,NaN,NaN,RPD,2017-01-19T20:11:28.000Z
1,12002,6f6731f4-dd64-44c7-895c-555de2703c8a,NaN,MISCELLANEOUS,81A,Miscellaneous/All Other Non-Offenses,NaN,NaN,NaN,RALEIGH,...,2017-07-29T12:35:00.000Z,2017,7,29,8,Saturday,NaN,NaN,RPD,2017-08-01T14:06:50.000Z

In [10]:
raleigh['crime_category'].value_counts().head()

MISCELLANEOUS    52188
ASSAULT          28513
LARCENY          24730
DRUGS            18155
VANDALISM        15562
Name: crime_category, dtype: int64

## Subsetting the columns

* Crime type
* Date
* Time
* Day of week
* City

## Durham

In [11]:
# Selecting required columns
durham = durham[['reportedas', 'date_occu', 'hour_occu', 'dow1']]

# Adding column "city"
durham = durham.assign(city = 'Durham')

# Renaming columns
durham = durham.rename(columns = {
    'reportedas' : 'crime_type',
    'date_occu'  : 'date',
    'hour_occu'  : 'hour',
    'dow1'       : 'day_of_week'
})

durham.head()

        crime_type                       date  hour day_of_week    city
0         BREAK IN  2013-01-02 00:00:00+00:00  2300          WE  Durham
1  DAMAGE TO PROPE  2013-01-02 00:00:00+00:00  1830          WE  Durham
2         BREAK IN  2012-12-24 00:00:00+00:00  1200          MO  Durham
3  BREAK IN IN PRO  2013-01-01 00:00:00+00:00  1858          TU  Durham
4     VEHICLE STOP  2013-01-02 00:00:00+00:00  2129          WE  Durham

## Raleigh

In [12]:
# Selecting required columns
raleigh = raleigh[['crime_category', 'reported_date', 'reported_hour', 'reported_dayofwk']]

# Adding column "city"
raleigh = raleigh.assign(city = 'Raleigh')

# Renaming columns
raleigh = raleigh.rename(columns = {
    'crime_category'   : 'crime_type',
    'reported_date'    : 'date',
    'reported_hour'    : 'hour',
    'reported_dayofwk' : 'day_of_week'
})

raleigh.head()

      crime_type                      date  hour day_of_week     city
0  MISCELLANEOUS  2017-01-15T03:28:00.000Z    22    Saturday  Raleigh
1  MISCELLANEOUS  2017-07-29T12:35:00.000Z     8    Saturday  Raleigh
2  MISCELLANEOUS  2016-03-07T03:52:00.000Z    22      Sunday  Raleigh
3  MISCELLANEOUS  2015-03-24T04:59:00.000Z     0     Tuesday  Raleigh
4  MISCELLANEOUS  2015-12-23T00:57:00.000Z    19     Tuesday  Raleigh

## Cary

In [13]:
# Selecting required columns
cary = cary[['crime_category', 'date_from', 'time_from', 'crimeday']]

# Adding column "city"
cary = cary.assign(city = 'Cary')

# Renaming columns
cary = cary.rename(columns = {
    'crime_category' : 'crime_type',
    'date_from'      : 'date',
    'time_from'      : 'hour',
    'crimeday'       : 'day_of_week'
})

cary.head()

  crime_type        date                       hour day_of_week  city
0  ALL OTHER  2017-01-16  0001-01-01 03:40:00+00:00      MONDAY  Cary
1  ALL OTHER  2016-11-10  0001-01-01 11:53:00+00:00    THURSDAY  Cary
2  ALL OTHER  2017-07-21  0001-01-01 23:24:00+00:00      FRIDAY  Cary
3  ALL OTHER  2017-09-22  0001-01-01 14:45:00+00:00      FRIDAY  Cary
4  ALL OTHER  2016-11-18  0001-01-01 05:02:00+00:00      FRIDAY  Cary

## Concatenating tables

In [14]:
crime_data = pd.concat([durham, raleigh, cary])
#showing 10 randow rows & if we run again 10 different rows
crime_data.sample(10)

             crime_type                       date hour day_of_week     city
16399      SEX OFFENSES   2015-01-17T06:30:00.000Z    1    Saturday  Raleigh
109570  DOMESTIC VIOLEN  2015-09-07 00:00:00+00:00  513          MO   Durham
213009  LARCENY FROM MV   2018-08-30T02:45:00.000Z   22   Wednesday  Raleigh
93373    LARCENY - FROM  2017-04-18 00:00:00+00:00  745         NaN   Durham
117094          ROBBERY   2017-05-12T18:41:00.000Z   14      Friday  Raleigh
196464  LARCENY FROM MV   2018-05-21T02:34:00.000Z   22      Sunday  Raleigh
73133           LARCENY   2017-05-18T18:07:00.000Z   14    Thursday  Raleigh
35420     MISCELLANEOUS   2015-07-15T22:26:00.000Z   18   Wednesday  Raleigh
207866            DRUGS   2018-07-04T07:23:00.000Z    3   Wednesday  Raleigh
87084         VANDALISM   2014-08-16T17:53:00.000Z   13    Saturday  Raleigh

### Transforming "date"

In [15]:
crime_data.date = crime_data.date.apply(lambda d: d[:10])
crime_data.head()

        crime_type        date  hour day_of_week    city
0         BREAK IN  2013-01-02  2300          WE  Durham
1  DAMAGE TO PROPE  2013-01-02  1830          WE  Durham
2         BREAK IN  2012-12-24  1200          MO  Durham
3  BREAK IN IN PRO  2013-01-01  1858          TU  Durham
4     VEHICLE STOP  2013-01-02  2129          WE  Durham

### Transforming "day_of_week"

In [16]:
crime_data.day_of_week.value_counts()

Friday       36367
Wednesday    34821
Thursday     34698
Tuesday      34346
Monday       34318
Saturday     33040
Sunday       30474
FR           18331
WE           17560
TH           17465
TU           16679
MO           16662
SA           16305
SU           14497
FRIDAY         699
MONDAY         668
WEDNESDAY      656
THURSDAY       632
TUESDAY        585
SATURDAY       569
SUNDAY         555
Name: day_of_week, dtype: int64

In [17]:
crime_data.day_of_week = crime_data.day_of_week.str.lower()

crime_data.day_of_week[crime_data.day_of_week == 'su'] = 'sunday'
crime_data.day_of_week[crime_data.day_of_week == 'mo'] = 'monday'
crime_data.day_of_week[crime_data.day_of_week == 'tu'] = 'tuesday'
crime_data.day_of_week[crime_data.day_of_week == 'we'] = 'wednesday'
crime_data.day_of_week[crime_data.day_of_week == 'th'] = 'thursday'
crime_data.day_of_week[crime_data.day_of_week == 'fr'] = 'friday'
crime_data.day_of_week[crime_data.day_of_week == 'sa'] = 'saturday'

crime_data.day_of_week.value_counts()

friday       55397
wednesday    53037
thursday     52795
monday       51648
tuesday      51610
saturday     49914
sunday       45526
Name: day_of_week, dtype: int64

In [18]:
crime_data.hour.head()

0    2300
1    1830
2    1200
3    1858
4    2129
Name: hour, dtype: object

In [19]:
crime_data.hour.tail()

4359    0001-01-01 13:30:00+00:00
4360    0001-01-01 12:00:00+00:00
4361    0001-01-01 22:00:00+00:00
4362    0001-01-01 12:00:00+00:00
4363    0001-01-01 13:00:00+00:00
Name: hour, dtype: object

In [20]:
#transformed hours to make the same
def transform_hour(hour):
    if len(str(hour)) < 5:
        hour = str(hour)[:4].zfill(4)
        return hour[:2] + ':' + hour[-2:] + ':00'
    else:
        return hour.split()[1][:8]

In [21]:
crime_data.hour = crime_data.hour.apply(transform_hour)
crime_data.head()

        crime_type        date      hour day_of_week    city
0         BREAK IN  2013-01-02  23:00:00   wednesday  Durham
1  DAMAGE TO PROPE  2013-01-02  18:30:00   wednesday  Durham
2         BREAK IN  2012-12-24  12:00:00      monday  Durham
3  BREAK IN IN PRO  2013-01-01  18:58:00     tuesday  Durham
4     VEHICLE STOP  2013-01-02  21:29:00   wednesday  Durham

In [22]:
crime_data.crime_type.nunique()

191

In [23]:
crime_data.crime_type.value_counts()

MISCELLANEOUS           52188
LARCENY                 45421
ASSAULT                 30376
DRUGS                   21627
FRAUD                   21484
VANDALISM               16446
LARCENY FROM MV         15137
BREAK IN                13158
ALL OTHER OFFENSES      11304
DRUG VIOLATIONS          9585
BREAK IN VEHICL          8450
BURGLARY/RESIDENTIAL     8301
TRAFFIC                  8053
DOMESTIC VIOLEN          7913
DAMAGE TO PROPE          6346
PRIVATE TOW              6187
WEAPONS VIOLATION        5412
HUMANE                   5373
MV THEFT                 4216
SHOPLIFTER               4006
LOST OR FOUND P          3110
ROBBERY                  3080
SEX OFFENSES             2922
VEHICLE STOP             2582
ALL OTHER                2451
DISORDERLY CONDUCT       2265
LARCENY OF VEHI          2165
BURGLARY/COMMERCIAL      2125
ARMED ROBBERY            2091
DISTURBANCE              1652
                        ...
OFFICER NEEDS A             5
BRIBERY                     4
STABBING AT HOS             4
VEHICLE ALARM               3
CRASH NOTIFICAT             3
PROWLER                     3
UNKNOWN FIRE                3
CALLS FOR SERVI             3
OVERDOSE                    2
TEST                        2
LARCENY - SHOPL             2
IMPAIRED DRIVIN             2
DROWNING                    2
FRAUD - CONFIDE             2
VEHICLE FIRE SU             2
EXPLOSION                   2
HANG UP WIRELES             2
ADBUCTION OR KI             1
DIRECT TRAFFIC              1
TRESPASS OR UMW             1
FRAUD - WORTHLE             1
PAST ABDUCTION              1
AIRCRAFT EMERGE             1
BOMB FOUND                  1
SIMPLE ASSAULT              1
PROTEST                     1
50 CRASH NOTIFI             1
BANK ALARM                  1
SCHOOL CROSSING             1
TRAIN CRASH                 1
Name: crime_type, Length: 191, dtype: int64

## Exporting to SQL

In [24]:
from sqlalchemy import create_engine
engine = create_engine('sqlite://', echo = False)

In [25]:
# Saving only first 1000 rows to keep it small
crime_data.head(1000).to_sql('crime_data', con = engine, if_exists='replace')

In [26]:
#SQL Query in database we just created
engine.execute('SELECT * FROM crime_data WHERE city = "Durham" LIMIT 5').fetchall()

[(0, 'BREAK IN', '2013-01-02', '23:00:00', 'wednesday', 'Durham'),
 (1, 'DAMAGE TO PROPE', '2013-01-02', '18:30:00', 'wednesday', 'Durham'),
 (2, 'BREAK IN', '2012-12-24', '12:00:00', 'monday', 'Durham'),
 (3, 'BREAK IN IN PRO', '2013-01-01', '18:58:00', 'tuesday', 'Durham'),
 (4, 'VEHICLE STOP', '2013-01-02', '21:29:00', 'wednesday', 'Durham')]